{
  "architectures": [
    "Grok1ForCausalLM"
  ],
  "embedding_multiplier_scale": 90.50966799187809,
  "output_multiplier_scale": 0.5,
  "vocab_size": 131072,
  "hidden_size": 8192,
  "intermediate_size": 32768,
  "moe_intermediate_size": 16384,
  "max_position_embeddings": 131072,
  "num_experts_per_tok": 2,
  "num_local_experts": 8,
  "residual_moe": true,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "num_hidden_layers": 1,
  "head_dim": 128,
  "rms_norm_eps": 1e-05,
  "final_logit_softcapping": 50,
  "attn_logit_softcapping": 30.0,
  "router_logit_softcapping": 30.0,
  "rope_theta": 208533496,
  "attn_temperature_len": 1024,
  "sliding_window_size": -1,
  "global_attn_every_n": 1,
  "model_type": "git",
  "torch_dtype": "bfloat16",
  "rope_type": "original",
  "original_max_position_embeddings": 8192,
  "scaling_factor": 16.0,
  "extrapolation_factor": 1.0,
  "attn_factor": 1.0,
  "beta_fast": 8,
  "beta_slow": 1
}